In [4]:
import numpy as np
import pandas as pd
frame=pd.DataFrame(np.random.randn(4,3),
                  columns=list("bde"),
                  index=["Utah","Ohio","Texas","Oregon"])
frame

               b         d         e
Utah   -0.043601  0.641514 -0.794286
Ohio   -0.929033  0.232066 -1.341830
Texas   0.837087  1.021271  0.304397
Oregon  2.345039 -1.414693  0.844385

In [6]:
print("The Minimum Value of d=",frame["d"].min())

The Minimum Value of d= -1.4146934097697945

In [7]:
print("The Maximum Value of d=",frame["d"].max())

The Maximum Value of d= 1.0212713412243992

In [11]:
print("Max-Min=",frame["d"].max() - frame["d"].min())

Max-Min= 2.4359647509941937

In [19]:
f=lambda  x: x.max() - x.min()
df=frame.apply(f)
df

b    3.274072
d    2.435965
e    2.186215
dtype: float64

In [20]:
df=frame.apply(f, axis=1) # for Row and Axis=0 for Columns
df

Utah      1.435800
Ohio      1.573896
Texas     0.716874
Oregon    3.759733
dtype: float64

**Sorting & Ranking**

In [30]:
frame=pd.DataFrame(np.arange(8).reshape((2,4)),
                  index=['three','one'],
                  columns=['d','a','b','c'])
print(frame)
print("*******")
print(frame.sort_index())

       d  a  b  c
three  0  1  2  3
one    4  5  6  7
*******
       d  a  b  c
one    4  5  6  7
three  0  1  2  3

# Arithematic and Data Allignment

In [42]:
df1=pd.DataFrame(np.arange(9).reshape((3,3)),
                index=["Ohio","Texas","Colorado"],
                columns=list("bcd"))
df2=pd.DataFrame(np.arange(12).reshape((4,3)),
                index=["utha","Ohio","Texas","Oregon"],
                columns=list("bde"))
print(df1)
print("-----------------")
print(df2)
print()
df3=df1+df2
df3

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8
-----------------
        b   d   e
utha    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
utha      NaN NaN   NaN NaN

In [53]:
df1=pd.DataFrame(np.arange(12).reshape((3,4))
                ,columns=list("abcd"))
df2=pd.DataFrame(np.arange(20).reshape((4,5)),
                columns=list("abcde"))
print(df1)
print("----------------------")
print(df2)
print("Addition direct opertion without using fil_value function")
df4= df1+ df2
print(df4)
print("**Addition using a method with repalce Nan to 0**")
df3=df1.add(df2, fill_value=0)
df3

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11
----------------------
    a   b   c   d   e
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19
Addition direct opertion without using fil_value function
      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN
**Addition using a method with repalce Nan to 0**

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

# Deleting Data

In [80]:
frame=pd.DataFrame(np.arange(12).reshape(3,4),
                  columns=["Samsung","Haier","Infinix","Oppo"], index=["Pak","Jap","Uae"])
frame

     Samsung  Haier  Infinix  Oppo
Pak        0      1        2     3
Jap        4      5        6     7
Uae        8      9       10    11

In [81]:
#For deleting Row
frame=frame.drop("Jap",axis=0)
frame

     Samsung  Haier  Infinix  Oppo
Pak        0      1        2     3
Uae        8      9       10    11

In [84]:
#For deleting Columns
frame=frame.drop("Haier",axis=1)
frame

     Infinix  Oppo
Pak        2     3
Uae       10    11